# Exercise 4.6 Combining and Exporting Data

## Step 1 Merged Instacart orders data with new orders_products_prior dataframe

See separate notebook 4.6 IC Task

## Step 2 Export orders_products_combined as a pkl

Completed in separate notebook 4.6 IC Task

## Step 3 Import libraries and dataframes

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os

In [2]:
# Create path

path = r"C:\Users\leobs\OneDrive\Data Program\Achievement 4_Instacart\Instacart Basket Analysis"

In [3]:
# Import merged dataframe from 4.6 practice

df_ords_prods_combined = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [4]:
# Check import

df_ords_prods_combined.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [5]:
# Import df_products_checked

df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'df_prods_checked.csv'), index_col = False)

In [6]:
# Check import

df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [9]:
# Remove unnamed column

df_prods = df_prods.drop(columns = ['Unnamed: 0'])

In [10]:
# Check removal

df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

## Step 4 check shape of dataframes

In [12]:
# Shape of combined df

df_ords_prods_combined.shape

(32434489, 10)

In [13]:
# Shape of products df

df_prods.shape

(49672, 5)

Note different number of rows and columns 

Matching column identifier is 'product_id', which will allow for the df.merge() function

Less rows for df_prods because each product has a unique id, while the df_orders_products_combined lists all orders which includes repeated products across orders

## Step 5 combine dataframes

In [15]:
# Remove '_merge' column from df_ords_prods_combined

df_ords_prods_combined = df_ords_prods_combined.drop(columns = ['_merge'])

In [16]:
# Check removal

df_ords_prods_combined.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

In [17]:
# Merge df_ords_prods_combined with df_prods using 'product_id'

df_ords_prods_combined_merged = df_ords_prods_combined.merge(df_prods, on = ['product_id'], indicator = True)

In [18]:
# Check merge columns

df_ords_prods_combined_merged.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

## Step 6 confirm results using the merge flag

In [19]:
# Check for full match

df_ords_prods_combined_merged['_merge'].value_counts()

# Successful merge with full match

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

## Step 7 export new dataframe

In [20]:
# Export as pkl file due to large file size

df_ords_prods_combined_merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged.pkl'))